In [2]:
import pandas as pd

In [3]:
k = pd.DataFrame({'c1':[2,1,3,0,0]})

In [4]:
m = pd.DataFrame({'c1':[1, 2], 'c2':[0, 1], 'c3':[-1,-2]})
# m = pd.DataFrame({'c2':[1, 1, 2, 2], 'c3':[0, 1, 2, 3]})

In [8]:
kk = pd.merge(k, m, on='c1', how='left')
kk

   c1   c2   c3
0   2  1.0 -2.0
1   1  0.0 -1.0
2   3  NaN  NaN
3   0  NaN  NaN
4   0  NaN  NaN

In [9]:
kk['c4'] = [3,2,3,3,3]
kk

   c1   c2   c3  c4
0   2  1.0 -2.0   3
1   1  0.0 -1.0   2
2   3  NaN  NaN   3
3   0  NaN  NaN   3
4   0  NaN  NaN   3

In [16]:
t = pd.DataFrame({'c1':[2, 0, 0], 'c4':[3, 3, 3], 'c5':[6, 7, 8]})
t

   c1  c4  c5
0   2   3   6
1   0   3   7
2   0   3   8

In [17]:
tt = pd.merge(kk, t, on=['c1', 'c4'], how='left')
tt

   c1   c2   c3  c4   c5
0   2  1.0 -2.0   3  6.0
1   1  0.0 -1.0   2  NaN
2   3  NaN  NaN   3  NaN
3   0  NaN  NaN   3  7.0
4   0  NaN  NaN   3  8.0
5   0  NaN  NaN   3  7.0
6   0  NaN  NaN   3  8.0

In [19]:
tt.loc[tt['c5']!=7]

   c1   c2   c3  c4   c5
0   2  1.0 -2.0   3  6.0
1   1  0.0 -1.0   2  NaN
2   3  NaN  NaN   3  NaN
4   0  NaN  NaN   3  8.0
6   0  NaN  NaN   3  8.0

In [59]:
from sklearn.model_selection import KFold
folds = KFold(n_splits=5, shuffle=True, random_state=1989)
for i, (t, v) in enumerate(folds.split(tt, tt)):
    print(i)
    print(t, v)

0
[1 2 4 5 6] [0 3]
1
[0 2 3 4 5] [1 6]
2
[0 1 2 3 4 6] [5]
3
[0 1 2 3 5 6] [4]
4
[0 1 3 4 5 6] [2]

In [60]:
tt['c6'] = 1

In [61]:
tt

   c1   c2   c3  c4   c5  c6
0   2  1.0 -2.0   3  6.0   1
1   1  0.0 -1.0   2  NaN   1
2   3  NaN  NaN   3  NaN   1
3   0  NaN  NaN   3  7.0   1
4   0  NaN  NaN   3  8.0   1
5   0  NaN  NaN   3  7.0   1
6   0  NaN  NaN   3  8.0   1

In [68]:
tt['c1'] = [1, 1, 0, 0, 0, 1, 0]
tt

   c1   c2   c3  c4    c5    c6
0   1  1.0 -2.0   3  50.0  60.0
1   1  0.0 -1.0   2  51.0  61.0
2   0  NaN  NaN   3   NaN   1.0
3   0  NaN  NaN   3   7.0   1.0
4   0  NaN  NaN   3   8.0   1.0
5   1  NaN  NaN   3   NaN   NaN
6   0  NaN  NaN   3   8.0   1.0

In [73]:
tt.loc[tt['c1']==1, ['c5', 'c6']] = pd.DataFrame({'c6':[60, 61, 65], 'c5':[50, 51, 55]}).values
tt

   c1   c2   c3  c4    c5    c6
0   1  1.0 -2.0   3  60.0  50.0
1   1  0.0 -1.0   2  61.0  51.0
2   0  NaN  NaN   3   NaN   1.0
3   0  NaN  NaN   3   7.0   1.0
4   0  NaN  NaN   3   8.0   1.0
5   1  NaN  NaN   3  65.0  55.0
6   0  NaN  NaN   3   8.0   1.0

In [70]:
t1 = tt.groupby('c5').agg(['mean', 'sum', 'std', 'count'])
t1

       c1                  c2                  c3                  c4      \
     mean sum  std count mean  sum std count mean  sum std count mean sum
c5
7.0     0   0  NaN     1  NaN  0.0 NaN     0  NaN  0.0 NaN     0    3   3
8.0     0   0  0.0     2  NaN  0.0 NaN     0  NaN  0.0 NaN     0    3   6
50.0    1   1  NaN     1  1.0  1.0 NaN     1 -2.0 -2.0 NaN     1    3   3
51.0    1   1  NaN     1  0.0  0.0 NaN     1 -1.0 -1.0 NaN     1    2   2

                   c6
      std count  mean   sum  std count
c5
7.0   NaN     1   1.0   1.0  NaN     1
8.0   0.0     2   1.0   2.0  0.0     2
50.0  NaN     1  60.0  60.0  NaN     1
51.0  NaN     1  61.0  61.0  NaN     1

In [72]:
t1.columns

MultiIndex([('c1',  'mean'),
            ('c1',   'sum'),
            ('c1',   'std'),
            ('c1', 'count'),
            ('c2',  'mean'),
            ('c2',   'sum'),
            ('c2',   'std'),
            ('c2', 'count'),
            ('c3',  'mean'),
            ('c3',   'sum'),
            ('c3',   'std'),
            ('c3', 'count'),
            ('c4',  'mean'),
            ('c4',   'sum'),
            ('c4',   'std'),
            ('c4', 'count'),
            ('c6',  'mean'),
            ('c6',   'sum'),
            ('c6',   'std'),
            ('c6', 'count')],
           )